Update diagrams to use mermaid
